-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jul 15, 2026 at 04:31 AM
-- Server version: 8.0.30
-- PHP Version: 8.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `gpa5`
--

-- --------------------------------------------------------

--
-- Table structure for table `districts`
--

CREATE TABLE `districts` (
  `id` bigint UNSIGNED NOT NULL,
  `division_id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_bn` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `code` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `lfcl_id` bigint UNSIGNED NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `districts`
--

INSERT INTO `districts` (`id`, `division_id`, `name`, `name_bn`, `code`, `lfcl_id`, `created_at`, `updated_at`) VALUES
(1, 1, 'Barguna', 'বরগুনা', '1004', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(2, 1, 'Barishal', 'বরিশাল', '1006', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(3, 1, 'Bhola', 'ভোলা', '1009', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(4, 1, 'Jhalokathi', 'ঝালকাঠি', '1042', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(5, 1, 'Patuakhali', 'পটুয়াখালী', '1078', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(6, 1, 'Pirojpur', 'পিরোজপুর', '1079', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(8, 2, 'Brahmanbaria', 'ব্রাহ্মণবাড়িয়া', '8', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(9, 2, 'Chandpur', 'চাঁদপুর', '2013', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(11, 2, 'Comilla', 'কুমিল্লা', '2019', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(18, 2, 'Bandarban', 'বান্দরবান', '2003', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(21, 2, 'Chittagong', 'চট্টগ্রাম', '2015', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(23, 2, 'Cox\'s Bazar', 'কক্সবাজার', '2022', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(24, 2, 'Feni', 'ফেনী', '2030', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(25, 2, 'Khagrachhari', 'খাগড়াছড়ি', '2046', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(26, 2, 'Lakshmipur', 'লক্ষ্মীপুর', '2051', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(27, 2, 'Noakhali', 'নোয়াখালী', '2075', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(28, 2, 'Rangamati', 'রাঙ্গামাটি', '2084', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(29, 3, 'Dhaka', 'ঢাকা', '3026', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(30, 3, 'Faridpur', 'ফরিদপুর', '3029', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(31, 3, 'Gazipur', 'গাজীপুর', '3033', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(32, 3, 'Gopalganj', 'গোপালগঞ্জ', '3035', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(33, 8, 'Jamalpur', 'জামালপুর', '4539', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(34, 3, 'Kishoreganj', 'কিশোরগঞ্জ', '3048', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(35, 3, 'Madaripur', 'মাদারীপুর', '3054', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(36, 3, 'Manikganj', 'মানিকগঞ্জ', '3056', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(37, 3, 'Munshiganj', 'মুন্সীগঞ্জ', '3059', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(38, 8, 'Mymensingh', 'ময়মনসিংহ', '3061', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(39, 3, 'Narayanganj', 'নারায়ণগঞ্জ', '3067', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(40, 3, 'Narsingdi', 'নরসিংদী', '3068', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(41, 8, 'Netrokona', 'নেত্রকোণা', '4572', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(42, 3, 'Rajbari', 'রাজবাড়ী', '3082', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(43, 3, 'Shariatpur', 'শরিয়তপুর', '3086', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(44, 8, 'Sherpur', 'শেরপুর', '4589', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(45, 3, 'Tangail', 'টাঙ্গাইল', '3093', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(46, 4, 'Bagerhat', 'বাগেরহাট', '4001', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(47, 4, 'Chuadanga', 'চুয়াডাঙ্গা', '4018', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(48, 4, 'Jashore', 'যশোর', '4041', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(49, 4, 'Jhenaidah', 'ঝিনাইদহ', '4044', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(50, 4, 'Khulna', 'খুলনা', '4047', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(51, 4, 'Kushtia', 'কুষ্টিয়া', '4050', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(52, 4, 'Magura', 'মাগুরা', '4055', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(53, 4, 'Meherpur', 'মেহেরপুর', '4057', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(54, 4, 'Narail', 'নড়াইল', '4065', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(55, 4, 'Satkhira', 'সাতক্ষীরা', '4087', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(56, 5, 'Bogra', 'বগুড়া', '5010', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(57, 5, 'Chapai Nawabganj', 'চাঁপাইনবাবগঞ্জ', '5070', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(58, 5, 'Joypurhat', 'জয়পুরহাট', '5038', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(59, 5, 'Naogaon', 'নওগাঁ', '5064', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(60, 5, 'Natore', 'নাটোর', '5069', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(61, 5, 'Pabna', 'পাবনা', '5076', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(62, 5, 'Rajshahi', 'রাজশাহী', '5081', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(63, 5, 'Sirajganj', 'সিরাজগঞ্জ', '5088', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(64, 6, 'Dinajpur', 'দিনাজপুর', '5527', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(65, 6, 'Gaibandha', 'গাইবান্ধা', '5532', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(66, 6, 'Kurigram', 'কুড়িগ্রাম', '5549', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(67, 6, 'Lalmonirhat', 'লালমনিরহাট', '5552', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(68, 6, 'Nilphamari', 'নীলফামারী', '5573', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(69, 6, 'Panchagarh', 'পঞ্চগড়', '5577', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(70, 6, 'Rangpur', 'রংপুর', '5585', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(71, 6, 'Thakurgaon', 'ঠাকুরগাঁও', '5594', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(72, 7, 'Habiganj', 'হবিগঞ্জ', '6036', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(73, 7, 'Moulvibazar', 'মৌলভীবাজার', '73', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(74, 7, 'Sunamganj', 'সুনামগঞ্জ', '6090', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(75, 7, 'Sylhet', 'সিলেট', '6091', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37'),
(76, 7, 'Default District', 'ডিফল্ট জেলা', '6092', 1, '2026-07-11 04:34:37', '2026-07-11 04:34:37');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `districts_code_unique` (`code`),
  ADD KEY `districts_division_id_index` (`division_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `districts`
--
ALTER TABLE `districts`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
